#1)for ციკლისა და range ის მეშვეობით ერთიდან ათამდე ლუწი რიცხვები

for cifrebi in range(0,10,2):
    print("ერთიდან ათამდე ლუწი რიცხვებია: ", cifrebi)
###
    
#2)while ციკლის მეშვეობით გამოიტანეთ ერთიდან ოცამდე ციფრები
    
num = 1
while num <= 20:
    print("ერთიდან ოცამდე ციფრებია: ", num)
    num += 1
###
    
#3)while ციკლის მეშვეობით ნულიდან ხუთის ჩათვლით ციფრების შეკრება

together = 0
number = 0

while number <= 5:
    together += number

    number += 1

print("0-დან 5-ის ჩათვლით რომ ციფრები შევკრიბოთ მივიღებთ: ", together,"-ს")
###

#4)for ციკლის გამოყენებით თითო სიმბოლოს გამოსახვა ყოველ ინტერაციაზე

for name in ("mate"):
    print("თითო სიმბოლო ყოველ  იტერაციაზე: ",name)
